
#tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "versent/homebrew-taps"
tap "mongodb/brew"
tap "bufbuild/buf"


cask "macfuse"

# General
brew "go"
brew "git" # Get a more up to date version of git than default on macOS
brew "vault"
brew "consul-template"
brew "nvm"  # Node Version Manager
brew "jq"
brew "yq"
brew "wget"
brew "mas"
brew "emacs"
brew "tree"
brew "netcat"
brew "zsh-completions"
brew "ack"
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"
brew "watch"
brew "jfrog-cli-go"
brew "rbenv"
brew "ruby-build"
brew "datawire/blackbird/telepresence"
brew "yarn"
brew "telnet"
brew "groovysdk"
brew "neovim"
brew "jsonnet"
brew "gnupg"
brew "gh"
brew "hugo"
brew "fontconfig"
brew "bat"
brew "ripgrep"
brew "saml2aws"

# services
brew "redis"
brew "act"

# Cloud
brew "awscli"
brew "aws-iam-authenticator"

#################
# This is used, but commented out, since it unnecessarily continues to re-install and fails to find python
# cask "google-cloud-sdk"
#################

# Kubernetes / Containers
brew "kubectl"
brew "k9s"
cask "docker"

# User applications
cask "1password"
brew "java"
brew "maven"
brew "openjdk@11"
brew "openjdk@17"
cask "firefox-developer-edition"
#cask "google-chrome"
cask "arc"
cask "intellij-idea"
cask "pycharm"
cask "webstorm"
cask "goland"
cask "bitbar"
cask "slack"
cask "discord"
cask "postman"
cask "sublime-text"
cask "alfred"
cask "dash6"
cask "zoom"
cask "visual-studio-code"
cask "epic-games"
cask "docker"
cask "spotify"
cask "arduino"
cask "tunnelblick"

cask "vlc"
cask "boop"
cask "stats"

cask "processing"
cask "iterm2"
cask "kitty"
brew "fish"
#cask "alacritty"

brew "jupyterlab"

brew "openvpn"
cask "openvpn-connect"
brew "postgresql"
brew "liquibase"

# Databases
cask "graphiql"
cask "dbeaver-community"
brew "duckdb"
brew "mongodb-community"
cask "mongodb-compass"
cask "pgadmin4"


brew "buf"
brew "bazelisk"
brew "clang-format"
