ack
act
adns
autoconf
aws-iam-authenticator
awscli
bat
bdw-gc
brotli
c-ares
ca-certificates
cairo
consul-template
docutils
eksctl
emacs
fontconfig
freetype
gdbm
gettext
gh
giflib
git
glib
gmp
gnupg
gnutls
go
graphite2
groovysdk
guile
harfbuzz
helm
hugo
hyperkit
icu4c
jansson
jemalloc
jfrog-cli
jpeg-turbo
jq
jsonnet
k9s
kubernetes-cli
kustomize
libassuan
libev
libevent
libffi
libgcrypt
libgpg-error
libidn2
libksba
libnghttp2
libpng
libpthread-stubs
libssh
libtasn1
libtermkey
libtiff
libtool
libunistring
libusb
libuv
libvterm
libx11
libxau
libxcb
libxdmcp
libxext
libxrender
little-cms2
luajit
luajit-openresty
luv
lz4
lzo
m4
mas
mpdecimal
msgpack
ncurses
neovim
netcat
nettle
nghttp2
node
npth
nvm
oniguruma
openjdk
openssl@1.1
openvpn
p11-kit
p7zip
pcre
pcre2
pinentry
pixman
pkcs11-helper
pkg-config
python@3.10
python@3.11
python@3.8
python@3.9
rbenv
readline
redis
ripgrep
ruby-build
saml2aws
scorecard
six
sqlite
sshfs
tcl-tk
telepresence
telnet
tmate
torsocks
tree
tree-sitter
unbound
unibilium
vale
vault
watch
wget
xorgproto
xz
yarn
yq
zsh-completions
zsh-history-substring-search
zsh-syntax-highlighting
zstd
1password
adoptopenjdk11
adoptopenjdk8
alacritty
alfred
arduino
atom
bitbar
boop
cloudapp
dash
discord
docker
dynalist
epic-games
firefox-developer-edition
goland
google-cloud-sdk
graphiql
intellij-idea
iterm2
kitty
muzzle
osxfuse
postman
processing
pycharm
sequel-pro
slack
spotify
stats
steam
sublime-text
visual-studio-code
vlc
webstorm
zoom
zoomus
