
tap "AdoptOpenJDK/openjdk"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "versent/homebrew-taps"


cask "osxfuse"

# General
brew "go"
brew "git" # Get a more up to date version of git than default on macOS
brew "vault"
brew "consul-template"
brew "nvm"  # Node Version Manager
brew "jq"
brew "yq"
brew "wget"
#brew "zsh"
brew "mas"
brew "emacs"
brew "tree"
brew "netcat"
brew "zsh-completions"
brew "ack"
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"
brew "watch"
brew "jfrog-cli-go"
brew "rbenv"
brew "ruby-build"
brew "datawire/blackbird/telepresence"
brew "yarn"
brew "telnet"
brew "groovysdk"
brew "neovim"
brew "jsonnet"
brew "gnupg"
brew "openvpn"
brew "gh"
brew "hugo"
brew "fontconfig"
brew "bat"
brew "ripgrep"
brew "saml2aws"
# services
brew "redis"

# Cloud
brew "awscli"
brew "aws-iam-authenticator"
cask "google-cloud-sdk"

# Kubernetes / Containers
brew "kubectl"
brew "hyperkit"
cask "docker"

# User applications
cask "1password"
cask "adoptopenjdk/openjdk/adoptopenjdk8"
cask "adoptopenjdk11"
cask "firefox-developer-edition"
#cask "google-chrome"
cask "intellij-idea"
cask "pycharm"
cask "webstorm"
#cask "goland"
cask "bitbar"
cask "slack"
cask "discord"
cask "postman"
#cask "pocket"
cask "sublime-text"
cask "alfred"
cask "dash"
cask "cloudapp"
cask "zoom"
cask "visual-studio-code"
cask "atom"
cask "epic-games"
cask "steam"
cask "docker"
cask "spotify"
cask "dynalist"
cask "arduino"
cask "graphiql"

cask "vlc"
cask "boop"

cask "processing"
cask "iterm2"
cask "kitty"
#cask "alacritty"
